

####################################################################################################
## Synthesizing to generic
####################################################################################################

syn_generic

####################################################################################################
## Synthesizing to gates
####################################################################################################

syn_map


#######################################################################################################
## Optimize Netlist
#######################################################################################################


syn_opt -incremental

report_timing
