
write_hdl  > ${OUTPUTS_PATH}/r2g.v

write_sdc  > ${OUTPUTS_PATH}/r2g.normal.sdc

report_timing

report_area

report_power


